app/controllers/companies_controller.rb

  def show
    @company = Company.find(params[:id])
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 0)

  def edit
    @company = Company.find(params[:id])
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 3)

  def create
    #@company = Company.new(params[:company])
    @company = Company.find_by_symbol(params[:company][:symbol])
---
SELECT * FROM `companies` WHERE (`companies`.`symbol` IS NULL) LIMIT 1

  def add
    @company = Company.new(params[:company])
    respond_to do |format|
      if @company.save
	YahooFinance::get_HistoricalQuotes_days( params[:company][:symbol] , (Date.today - Date.parse('2009-01-01')).to_i ) do |hq|
	 # @company.stocks = [Stock.new(:day => hq.date, :open => hq.open, :high => hq.high, :low => hq.low, :close => hq.close,
	#			    :volume => hq.volume, :adjusted_close => hq.adjClose)]
	  stock = Stock.new(:company => @company, :day => hq.date, :open => hq.open, :high => hq.high, :low => hq.low, :close => hq.close,
				    :volume => hq.volume, :adjusted_close => hq.adjClose)
	  stock.save
---
INSERT INTO `companies` (`name`, `created_at`, `symbol`, `updated_at`) VALUES(NULL, '2010-01-23 08:36:45', 'cvs', '2010-01-23 08:36:45')
INSERT INTO `stocks` (`open`, `created_at`, `high`, `close`, `updated_at`, `day`, `volume`, `company_id`, `low`, `adjusted_close`) VALUES(33.07, '2010-01-23 09:18:39', 33.82, 33.24, '2010-01-23 09:18:39', '2010-01-22', 10972000.0, 1, 32.7, 33.24)